#include "main.h"
#include "init.h"
#include "it.h"
#include "ILI9341_GFX.h"
#include "si5351.h"

extern arm_cfft_instance_q15 cfft;           // Структура состояний для arm_cfft_q15
extern q15_t complex_in_fft[512];            // Входной массив для БПФ{re, im, re, im...}
extern uint16_t fft_size;                    // Размер массива FFT
uint16_t out_mag_fft[256];                   // Выход с реальными уровнями
uint16_t s_metr = 100;

extern uint32_t   main_frec;
extern uint16_t   step;                        // Шаг перестройки
extern int16_t    cal_si;                      // Калибровка si
extern bool       fft_arr_fl;                  // Флаг заполнения массива	
extern bool       menu_fl;                     // Флаг фхода в меню
extern bool       sub_menu_fl;                 // Флаг фхода в подменю
// Инициализация переменных навигации (начинаем с Главного меню, 0-й строки)
extern uint8_t current_menu;
extern uint8_t current_submenu;
//extern bool       a_b_frec;                  // частота A(0), B(1)
//extern uint8_t    band_idx;                  // Текущий диапазон
//extern uint32_t   bands_frec_a[];            // Диапазоны частота
//extern uint32_t   bands_frec_b[];            // Диапазоны частота
extern trx_state_t trx_state;                  // Текущее состояние трансивера
extern trx_state_f trx_state_flag;             // Флаги состояния трансивера

extern q15_t s_peak;                           // Значения для с-метра
extern uint8_t code_button; 
extern char txt_butt[32];
extern bool rx_tx_fl;

// Значения уменьшены, чтобы максимум был 32767
const q15_t hamming_window_256[256] = {
    2313, 2317, 2329, 2348, 2376, 2410, 2454, 2504, 2561, 2627, 2700, 2781, 2868, 2963, 3066, 3175, 
    3292, 3415, 3546, 3683, 3827, 3978, 4135, 4299, 4470, 4646, 4829, 5018, 5214, 5414, 5621, 5834, 
    6052, 6275, 6504, 6739, 6978, 7222, 7471, 7725, 7983, 8246, 8513, 8784, 9059, 9338, 9621, 9907, 
    10197, 10490, 10786, 11086, 11388, 11693, 12000, 12310, 12622, 12937, 13253, 13571, 13891, 14213, 14536, 14860, 
    15185, 15511, 15838, 16166, 16494, 16823, 17152, 17480, 17809, 18137, 18465, 18791, 19117, 19443, 19767, 20090, 
    20412, 20732, 21050, 21367, 21682, 21995, 22306, 22614, 22920, 23223, 23523, 23821, 24115, 24406, 24693, 24977, 
    25258, 25535, 25808, 26078, 26343, 26605, 26862, 27116, 27364, 27609, 27848, 28083, 28313, 28538, 28758, 28973, 
    29183, 29388, 29587, 29781, 29969, 30152, 30329, 30501, 30666, 30826, 30981, 31129, 31272, 31408, 31539, 31664, 
    31783, 31895, 32002, 32103, 32197, 32285, 32367, 32443, 32513, 32576, 32633, 32684, 32728, 32766, 32767, 32767, 
    32767, 32767, 32766, 32728, 32684, 32633, 32576, 32513, 32443, 32367, 32285, 32197, 32103, 32002, 31895, 31783, 
    31664, 31539, 31408, 31272, 31129, 30981, 30826, 30666, 30501, 30329, 30152, 29969, 29781, 29587, 29388, 29183, 
    28973, 28758, 28538, 28313, 28083, 27848, 27609, 27364, 27116, 26862, 26605, 26343, 26078, 25808, 25535, 25258, 
    24977, 24693, 24406, 24115, 23821, 23523, 23223, 22920, 22614, 22306, 21995, 21682, 21367, 21050, 20732, 20412, 
    20090, 19767, 19443, 19117, 18791, 18465, 18137, 17809, 17480, 17152, 16823, 16494, 16166, 15838, 15511, 15185, 
    14860, 14536, 14203, 13891, 13571, 13278, 12937, 12622, 12310, 12000, 11693, 11388, 11086, 10786, 10490, 10197, 
    9907, 9621, 9338, 9059, 8784, 8513, 8246, 7983, 7725, 7471, 7222, 6978, 6739, 6504, 6275, 6052, 
    5834, 5621, 5414, 5214, 5018, 4829, 4646, 4470, 4299, 4135, 3978, 3827, 3683, 3546, 3415, 3292, 
    3175, 3066, 2963, 2868, 2781, 2700, 2627, 2561, 2504, 2454, 2410, 2376, 2348, 2329, 2317, 2313
};

const uint16_t cic3_comp_256[256] = {
    256, 256, 256, 256, 256, 256, 257, 257, 257, 258, 258, 258, 259, 259, 260, 260,
    261, 262, 262, 263, 264, 265, 265, 266, 267, 268, 269, 270, 271, 273, 274, 275,
    276, 278, 279, 280, 282, 284, 285, 287, 289, 290, 292, 294, 296, 298, 300, 302,
    304, 307, 309, 311, 314, 316, 319, 321, 324, 327, 330, 333, 336, 339, 342, 346,
    349, 353, 356, 360, 364, 368, 372, 376, 380, 384, 389, 393, 398, 403, 408, 413,
    418, 424, 429, 435, 441, 447, 453, 459, 466, 472, 479, 486, 494, 501, 509, 517,
    525, 533, 542, 551, 560, 570, 579, 589, 600, 610, 621, 632, 644, 656, 668, 681,
    694, 708, 722, 736, 751, 766, 768, 768, 768, 768, 768, 768, 768, 768, 768, 768,
    768, 768, 768, 768, 768, 768, 768, 768, 768, 768, 768, 768, 766, 751, 736, 722,
    708, 694, 681, 668, 656, 644, 632, 621, 610, 600, 589, 579, 570, 560, 550, 542,
    533, 525, 517, 509, 501, 494, 486, 479, 472, 466, 459, 453, 447, 441, 435, 429,
    424, 418, 413, 408, 403, 398, 393, 389, 384, 380, 376, 372, 368, 364, 360, 356,
    353, 349, 346, 342, 339, 336, 333, 330, 327, 324, 321, 319, 316, 314, 311, 309,
    307, 304, 302, 300, 298, 296, 294, 292, 290, 289, 287, 285, 284, 282, 280, 279,
    278, 276, 275, 274, 273, 271, 270, 269, 268, 267, 266, 265, 265, 264, 263, 262,
    262, 261, 260, 260, 259, 259, 258, 258, 258, 257, 257, 257, 256, 256, 256, 256
};

// Функция перевода амплитуды Q15 в значение для пикселя водопада (0-255)
uint8_t magnitude_to_db_pixel(q15_t mag) {
    if (mag <= 0) return 0;

    // Вариант А: Использование стандартной библиотеки (точнее, но медленнее)
    // Переводим в float (0..1), берем лог, нормируем под экран
    float float_mag = (float)mag / 32767.0f;
    float db = 20.0f * log10f(float_mag + 1e-6f); // +1e-6 чтобы не было log(0)
    
    // Обычно диапазон водопада — это последние 60-80 дБ
    // Сдвигаем и масштабируем результат в 0..255 для отрисовки
    int16_t pixel = (int16_t)(db + 80) * 3; // Пример: -80дБ -> 0, 0дБ -> 240
    
    if (pixel < 0) return 0;
    if (pixel > 255) return 255;
    return (uint8_t)pixel;
}

int main(void) {
	
	SysTick_Setup();               // Настройка системного таймера
  GPIO_Init();   	               // инициализация портов ввода вывода
	
 	TRX_State_Load();              // Загрузка из флеш последнего состояния
	
	SPI2_init();                   // инициализация SPI
  PWM2_Init();                   // Инициализация шим
  PWM3_Init();                   // Инициализация шим
	TIM4_Init();                   // инициализация таймера 4 для массивов преобразования Гилберта и ФНЧ
	ADC_DMA_Init();
 
  I2C1_Init();                   // Инициализация I2C1


	si5351_Init(cal_si);
	si5351_SetFrec(trx_state.vfo_a_freq[trx_state.current_band]<<2);// Запустили текущую частоту
  Set_mode();                    // Установка режима модуляции из trx_state
	DSP_init();                    // Инициализация DSP
	arm_cfft_init_256_q15(&cfft);  // БПФ для водопада	
	
	ADC2->CR2 |= ADC_CR2_SWSTART;	 // Стартуем ацп
	ADC1->CR2 |= ADC_CR2_SWSTART;  //	
	TIM4->CR1 |= TIM_CR1_CEN;      // Стартуем преобразование гилберта и фнч	
	
	TIM1_Encoder_Init();           // Инициализация энкодера
	GPIO_Init_Buttons();           // Инициализация кнопок	

	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ILI9341_Init(); // инициализация дисплея
	//ILI9341_Set_Rotation(SCREEN_HORIZONTAL_2); // установка ориентации экрана (варианты в файле ILI9341_GFX.h) для ILI9341
	ILI9341_Set_Rotation(SCREEN_HORIZONTAL_1); // установка ориентации экрана (варианты в файле ILI9341_GFX.h) для ST7789
	/////////////////////////// далее демонстрируются различные пользовательские функции ////////////////////////////
	Main_Scren_Init(); // Отрисовываем главный экран
			if (rx_tx_fl==0) {                   // RX/TX
				ILI9341_WriteString( 46, 108, "R", Font_16x26, GREEN, MYFON); // RX/TX
				RX_Device_Inint();
			}
			else {
				ILI9341_WriteString( 46, 108, "T", Font_16x26, GREEN, MYFON); // RX/TX
				TX_Device_Inint();
			}	/**/
	PWR_Init();          // Инициализация контроля питания	
	while(1) {		
	  if (fft_arr_fl) // если массив для бпф заполнен делаем преобразование и выводим
	  {
			for (int i = 0; i < 256; i++) {
        q15_t w = hamming_window_256[i];
        complex_in_fft[i<<1]       = (q15_t)(((q31_t)complex_in_fft[i<<1]       * w) >> 15);
        complex_in_fft[(i<<1) + 1] = (q15_t)(((q31_t)complex_in_fft[(i<<1) + 1] * w) >> 15);
      }
			
			arm_cfft_q15(&cfft, complex_in_fft, 0, 1);
			//arm_cmplx_mag_q31(complex_in_fft, out_mag_fft, 256);  

			for (int j = 0; j < 256; j++) {
					// Извлекаем Real и Imaginary компоненты
					int32_t re = complex_in_fft[(j << 1)];
					int32_t im = complex_in_fft[(j << 1) + 1];
					
					// Берем модуль (абсолютное значение)
					if (re < 0) re = -re;
					if (im < 0) im = -im;
					
					// Линейное приближение вектора (метод Alpha-Beta)
					int32_t max_val = (re > im) ? re : im;
					int32_t min_val = (re > im) ? im : re;
					int32_t mag = max_val + ((min_val * 3) >>3); // Результат лежит в диапазоне 0...32767
				
					// === Цифровая компенсация завала CIC-фильтра ===
					// Умножаем на q8 коэффициент и сдвигаем на 8 бит. 
					// Так как макс. mag = 32767, а макс. коэф = 768, промежуточное произведение 
					// уложится в ~25 000 000, что идеально заходит в рамки signed int32_t.
					mag = (mag * cic3_comp_256[j]) >> 8;					
					// Ограничение под палитру (clipping)
					if (mag > 255) mag = 255;	
					// Записываем чистые 256 градаций
					out_mag_fft[j] = (q15_t)mag;
			}/**/

			ILI9341_Draw_Waterfall(out_mag_fft); // выводим строку водопада
			//ILI9341_Draw_Waterfall(complex_in_fft); // выводим строку водопада
			fft_arr_fl = false; // массив готов к заполнению //
      
	  }
	  else
	  {
			//ILI9341_Draw_MainFrec(TIM1->CNT);
		  ILI9341_Draw_Smetr(s_peak); // выводим показометр
			s_peak = 0;
			
				if(!menu_fl){ // Если не в меню
					if (trx_state_flag.volume_enabled){           // Если регулируем громкость
						int32_t tmp = trx_state.volume;
						if (Process_Encoder(&tmp, 1, 0, 100)){ // Если энкодер крутили
							trx_state.volume = tmp;
							ILI9341_Draw_Menu_Var( 46+11*9, 108 + 26 + 18, trx_state.volume);
						}
					} else
					if (!trx_state.active_vfo) {      						// VFO A
						if (Process_Encoder(&trx_state.vfo_a_freq[trx_state.current_band], trx_state.tuning_step, 0, 30000000)) { // Если частота изменилась
							// Этот блок выполнится только при повороте ручки
							ILI9341_Draw_MainFrec(78, 108, trx_state.vfo_a_freq[trx_state.current_band]);
							si5351_SetFrec(trx_state.vfo_a_freq[trx_state.current_band]<<2);
						}
					}
					else {     	                                   // VFO B
						if (Process_Encoder(&trx_state.vfo_b_freq[trx_state.current_band], trx_state.tuning_step, 0, 30000000)) { // Если частота изменилась
							// Этот блок выполнится только при повороте ручки
							ILI9341_Draw_MainFrec(78, 108, trx_state.vfo_b_freq[trx_state.current_band]);
							si5351_SetFrec(trx_state.vfo_b_freq[trx_state.current_band]<<2);
						}
					}
				}
				else{ // Если в основном меню
					if(sub_menu_fl){ // Если в подменю
						//DrawVarMenu(current_menu, current_submenu);
						Menu_Enc(current_menu, current_submenu);
					}	
				}
			
	  }	
	}
}


